readme.org
#+STARTUP: indent
#+hugo_base_dir: /Users/mengqiangding/study/blog/
#+hugo_section: post
#+hugo_auto_set_lastmod: t
#+hugo_code_fence: nil
#+options: author:nil
#+hugo_custom_front_matter: :author "mengqiangding"
#+STARTUP: logdrawer
#+TITLE: emacs学习记录
* git 操作
** 使.gitignore生效
#+begin_src shell
  ~/.emacs.d $ git rm -r –-cached . #清除缓存
  ~/.emacs.d $ git add . #重新按照ignore的规则add所有的文件
  ~/.emacs.d $ git commit -m “update .gitignore” #提交和注释
#+end_src

** 设置tag
#+begin_src shell
  git tag [tagName]   # 创建tag, 名称为tagName
  git push origin [tagName] #推送到远端仓库
#+end_src


* org 操作
** 手册
1. [[https://orgmode.org/manual/index.html][The Org Manual]]
2. aa
** 基本操作
1. 使用*设置标题级别
2. 设置任务状态: C-c C-t org-todo
3. 设置check boxes
5. 设置结束时间: C-c C-d org-deadline
6. 换行（格式同上一行）：org-mata-return
7. 设置logbook
| 操作名       | 指令                               | 快捷键    | detail  |   |
|--------------+------------------------------------+-----------+---------+---|
| 插入同级标题 | org-insert-heading-respect-content | C-RET     | [[*org-insert-heading-respect-content][org-ins]] |   |
| 插入次级标题 | org-insert-subheading              |           |         |   |
| 标题降级     | org-metaleft                       | M-<left>  |         |   |
| 标题升级     | org-metaright                      | M-<right> |         |   |
| 标题树降级   | org-demote-subtree                 | C-c C->   |         |   |
| 标题树升级   | org-promote-subtree                | C-c C-<   |         |   |
** org 特殊字符表示
| 字符 | 表示法  |   |
|------+---------+---|
| 竖线 | \vert{} |   |

** org-agenda操作 
1. 设置持续时间(格式: 00:xx): e org-agenda-set-effort  
2. 过滤持续时间: _ org-agenda-filter-by-effort
3. 设置tag: : org-agenda-set-tags 

