readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-11 三 14:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="孟强定" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org68ab5d4">1. git 操作</a>
<ul>
<li><a href="#org5f891c6">1.1. 使.gitignore生效</a></li>
<li><a href="#org767f436">1.2. 设置tag</a></li>
</ul>
</li>
<li><a href="#orgc7925e5">2. org 操作</a>
<ul>
<li><a href="#org43a12fa">2.1. 基本操作</a></li>
<li><a href="#org3a2c1e8">2.2. org-agenda操作</a></li>
<li><a href="#orge08edd2">2.3. 表格操作</a></li>
<li><a href="#orgf58c090">2.4. 链接操作</a>
<ul>
<li><a href="#org11e7b8a">2.4.1. 文件链接</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org25c0a1d">3. 用hugo写博客</a>
<ul>
<li><a href="#orgd47d3a6">3.1. 安装 hugo + even主题</a></li>
<li><a href="#org46e1df2">3.2. emacs 安装 ox-hugo</a></li>
<li><a href="#orge429b12">3.3. eglot</a></li>
<li><a href="#org2182f19">3.4. </a></li>
</ul>
</li>
<li><a href="#org1c813c0">4. detail</a>
<ul>
<li><a href="#orged66c5a">4.1. org-insert-heading-respect-content</a></li>
</ul>
</li>
<li><a href="#org5b80614">5. Workspace</a>
<ul>
<li><a href="#org1284f71">5.1. Daily routine <code>[0%]</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Learn">Learn</span></span></a></li>
<li><a href="#org4727373">5.2. <span class="todo TODO">TODO</span> Learn Emacs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Emacs">Emacs</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org68ab5d4" class="outline-2">
<h2 id="org68ab5d4"><span class="section-number-2">1.</span> git 操作</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5f891c6" class="outline-3">
<h3 id="org5f891c6"><span class="section-number-3">1.1.</span> 使.gitignore生效</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-shell">~/.emacs.d $ git rm -r –-cached . #清除缓存
~/.emacs.d $ git add . #重新按照ignore的规则add所有的文件
~/.emacs.d $ git commit -m “update .gitignore” #提交和注释
</pre>
</div>
</div>
</div>

<div id="outline-container-org767f436" class="outline-3">
<h3 id="org767f436"><span class="section-number-3">1.2.</span> 设置tag</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-shell">git tag [tagName]   # 创建tag, 名称为tagName
git push origin [tagName] #推送到远端仓库
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgc7925e5" class="outline-2">
<h2 id="orgc7925e5"><span class="section-number-2">2.</span> org 操作</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org43a12fa" class="outline-3">
<h3 id="org43a12fa"><span class="section-number-3">2.1.</span> 基本操作</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>使用*设置标题级别</li>
<li>设置任务状态: C-c C-t org-todo</li>
<li>设置check boxes</li>
<li>设置结束时间: C-c C-d org-deadline</li>
<li>换行（格式同上一行）：org-mata-return</li>
<li>设置logbook</li>
</ol>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">操作名</th>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">detail</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">插入同级标题</td>
<td class="org-left">org-insert-heading-respect-content</td>
<td class="org-left">C-RET</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">插入次级标题</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">标题级别变更</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">标题树级别变更</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
<a href="#orged66c5a">4.1</a>
</p>
</div>
</div>
<div id="outline-container-org3a2c1e8" class="outline-3">
<h3 id="org3a2c1e8"><span class="section-number-3">2.2.</span> org-agenda操作</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>设置持续时间(格式: 00:xx): e org-agenda-set-effort</li>
<li>过滤持续时间: _ org-agenda-filter-by-effort</li>
<li>设置tag: : org-agenda-set-tags</li>
</ol>
</div>
</div>
