readme.org
** 表格操作
一定一定要学会使用表格，表格更加直观，可以在表格中增加链接，链接到详细说明处。
如果使用evil-mode，可能有些快捷键不起作用，但是指令还是可以使用
|          | 操作名         | 指令                    | 快捷键      | 备注                     | 其他 |
|----------+----------------+-------------------------+-------------+--------------------------+------|
| 基础操作 | 创建表格       | org-table-create        | C-c \vert{} | 可以指定表格大小比如 4x3 |      |
|          | 遍历表格       | org-cycle               | TAB         |                          |      |
|          | 反向遍历       | org-shiftab             | S-TAB       |                          |      |
|          | 插入行         | org-table-insert-row    | RET         |                          |      |
|          | 插入分隔行     | org-table-insert-hline  | C-c -       | org-ctrl-c-minus         |      |
|          | 插入列         | org-table-insert-column |             |                          |      |
|          | 整行上移       | org-metaup              | M-<up>      | up为向向上键             |      |
|          | 整行下移       | org-metadown            | M-<down>    |                          |      |
|          | 整列左移       | org-metaleft            | M-<left>    |                          |      |
|          | 整列右移       | org-metaright           | M-<right>   |                          |      |
|          | 当前内容下移   | org-meta-return         | M-RET       |                          |      |
|----------+----------------+-------------------------+-------------+--------------------------+------|
| 进阶操作 | 插入静态时间戳 | org-time-stamp-inactive | C-c !       | 时间戳不会改变           |      |
|          | 插入动态时间戳 | org-time-stamp          | C-c .       |                          |      |
|          | 折叠列         | org-ctrl-c-tab          | C-c TAB     |                          |      |
|          | 删除列         | org-table-delete-column |             |                          |      |
** 链接操作
| 操作名     | 指令                    | 快捷键  | 备注               |   |
|------------+-------------------------+---------+--------------------+---|
| 创建链接   | org-insert-link         | C-c C-l | 可以直接按照格式写 |   |
| 展开链接   | org-toggle-link-display |         |                    |   |
| 跳转到链接 | org-open-at-point       | C-c C-o |                    |   |
| 补全       | completion-at-point     |         | [[*]特殊操作       |   |

