readme.html

<div id="outline-container-orge08edd2" class="outline-3">
<h3 id="orge08edd2"><span class="section-number-3">2.3.</span> 表格操作</h3>
<div class="outline-text-3" id="text-2-3">
<p>
一定一定要学会使用表格，表格更加直观，可以在表格中增加链接，链接到详细说明处。
如果使用evil-mode，可能有些快捷键不起作用，但是指令还是可以使用
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">操作名</th>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">备注</th>
<th scope="col" class="org-left">其他</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">基础操作</td>
<td class="org-left">创建表格</td>
<td class="org-left">org-table-create</td>
<td class="org-left">C-c &vert;</td>
<td class="org-left">可以指定表格大小比如 4x3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">遍历表格</td>
<td class="org-left">org-cycle</td>
<td class="org-left">TAB</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">反向遍历</td>
<td class="org-left">org-shiftab</td>
<td class="org-left">S-TAB</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">插入行</td>
<td class="org-left">org-table-insert-row</td>
<td class="org-left">RET</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">插入分隔行</td>
<td class="org-left">org-table-insert-hline</td>
<td class="org-left">C-c -</td>
<td class="org-left">org-ctrl-c-minus</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">插入列</td>
<td class="org-left">org-table-insert-column</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">整行上移</td>
<td class="org-left">org-metaup</td>
<td class="org-left">M-&lt;up&gt;</td>
<td class="org-left">up为向向上键</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">整行下移</td>
<td class="org-left">org-metadown</td>
<td class="org-left">M-&lt;down&gt;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">整列左移</td>
<td class="org-left">org-metaleft</td>
<td class="org-left">M-&lt;left&gt;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">整列右移</td>
<td class="org-left">org-metaright</td>
<td class="org-left">M-&lt;right&gt;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">当前内容下移</td>
<td class="org-left">org-meta-return</td>
<td class="org-left">M-RET</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">进阶操作</td>
<td class="org-left">插入静态时间戳</td>
<td class="org-left">org-time-stamp-inactive</td>
<td class="org-left">C-c !</td>
<td class="org-left">时间戳不会改变</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">插入动态时间戳</td>
<td class="org-left">org-time-stamp</td>
<td class="org-left">C-c .</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf58c090" class="outline-3">
<h3 id="orgf58c090"><span class="section-number-3">2.4.</span> 链接操作</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">操作名</th>
<th scope="col" class="org-left">指令</th>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">备注</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">创建链接</td>
<td class="org-left">org-insert-link</td>
<td class="org-left">C-c C-l</td>
<td class="org-left">可以直接按照格式写</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">展开链接</td>
<td class="org-left">org-toggle-link-display</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">跳转到链接</td>
<td class="org-left">org-open-at-point</td>
<td class="org-left">C-c C-o</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">补全</td>
<td class="org-left">completion-at-point</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">[[*]特殊操作</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
