readme.html

<div id="outline-container-org11e7b8a" class="outline-4">
<h4 id="org11e7b8a"><span class="section-number-4">2.4.1.</span> 文件链接</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
我第一次想用链接，是在使用表格的时候，表格的有点是直观，缺点就是可容纳信息较少，所以我想着，把
复杂的内容单独写在一个headline中，在增加一个链接方便跳转。
网上的资料大都不太全，所以最终还是找到官方文档：
</p>
<ol class="org-ol">
<li><a href="https://orgmode.org/manual/Link-Format.html">https://orgmode.org/manual/Link-Format.html</a></li>
<li><a href="https://orgmode.org/manual/Internal-Links.html">https://orgmode.org/manual/Internal-Links.html</a></li>
<li><a href="https://orgmode.org/manual/Search-Options.html">https://orgmode.org/manual/Search-Options.html</a></li>
</ol>

<p>
如果从来没用用过 org-mode 的 Hyperlinks可以先看第一篇文章。
简单来说链接其实就是特殊的纯文本：
</p>
<div class="org-src-container">
<pre class="src src-shell">[[LINK][DESCRIPTION]]

举例：
1. [[http://www.baidu.com][这个链接会指向百度]]
2. [[file::~/code/main.cc][这个链接指向一个本地文件]]
</pre>
</div>
<p>
"LINK" 表示链接内容， DESCRIPTION 为用来展示的名字, 跳转是通过指令org-open-at-point。
</p>

<p>
紧接着第二篇文章，就讲了内部链接，我没太看懂，而且实践也没有成功。
这里简单总结一下，说不定以后就能明白了：
</p>
<div class="org-src-container">
<pre class="src src-shell">主要格式为以下三种
1. [[#my-custom-id]]
2. [[*some section]]
3. [[target]] 
</pre>
</div>
<p>
三种格式，
my-custom-id应该是一种特定的id,但是我不知道怎么设置
</p>

<p>
*some section 就是指一个标题(headline)，文章里还提到了一种简单写法，即先写括号和星号,然后按 M-TAB,
所有的标题就会出现在一个 buffer 中，然后选择想要的即可。
原文：
To insert a link targeting a headline, in-buffer completion can be used. Just type a star followed by a few optional letters into the buffer and press M-TAB.
All headlines in the current buffer are offered as completions.
</p>

<p>
第三种格式，target 即表示一个标记，只要在两个尖括号你的内容都可以是一个标记
</p>
<div class="org-src-container">
<pre class="src src-shell">比如这篇文章有如下两行：
&lt;&lt;这是一个标记&gt;&gt;
[[这是一个标记]]  那么这个链接就会跳到上面那一行
</pre>
</div>
<p>
但是我没有成功过。
</p>

<p>
第三篇文章讲的是文件链接，其实内部链接也是文件链接的一种，我尝试了一下，确实可行。
</p>

<div class="org-src-container">
<pre class="src src-org">举例：
[[file:~/code/main.c::255]]
[[file:~/xx.org::My Target]]
[[file:~/xx.org::*My Target]]
[[file:~/xx.org::#my-custom-id]]
[[file:~/xx.org::/regexp/]]
[[attachment:main.c::255]]
</pre>
</div>
<p>
主要是多了一个file前缀，应该很好理解，那么我想链接到当前文件的某个标题可以这样：
</p>
<div class="org-src-container">
<pre class="src src-org">* headline1
** 1.1
** 1.2
** 这是 1.3
* headline2
** 2.1

[[file:::1.1]]  这个会跳转到  "标题1.1"
[[file:::这是 1.3]] 这个会跳转到标题 "这是 1.3"
</pre>
</div>

<p>
最终发现其实很简单，不过目前也只会跳转到标题，其他的花里胡哨的功能还不会
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-org25c0a1d" class="outline-2">
<h2 id="org25c0a1d"><span class="section-number-2">3.</span> 用hugo写博客</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd47d3a6" class="outline-3">
<h3 id="orgd47d3a6"><span class="section-number-3">3.1.</span> 安装 hugo + even主题</h3>
</div>

<div id="outline-container-org46e1df2" class="outline-3">
<h3 id="org46e1df2"><span class="section-number-3">3.2.</span> emacs 安装 ox-hugo</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li><a href="https://github.com/kaushalmodi/ox-hugo">https://github.com/kaushalmodi/ox-hugo</a></li>
<li>org 转换成 markdown， author设置</li>
</ol>
</div>
</div>

<div id="outline-container-orge429b12" class="outline-3">
<h3 id="orge429b12"><span class="section-number-3">3.3.</span> eglot</h3>
</div>

<div id="outline-container-org2182f19" class="outline-3">
<h3 id="org2182f19"><span class="section-number-3">3.4.</span> </h3>
</div>
</div>

<div id="outline-container-org1c813c0" class="outline-2">
<h2 id="org1c813c0"><span class="section-number-2">4.</span> detail</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orged66c5a" class="outline-3">
<h3 id="orged66c5a"><span class="section-number-3">4.1.</span> org-insert-heading-respect-content</h3>
<div class="outline-text-3" id="text-4-1">
<p>
这个指令会插入同级标题，会往上找到距离当前光标最近的标题，然后插入同级标题。
大家可以自行尝试，在文章的一级/二级/ 三级标题处，正文处分别按下C-RET 快捷键盘看看效果。
</p>
</div>
</div>
</div>

<div id="outline-container-org5b80614" class="outline-2">
<h2 id="org5b80614"><span class="section-number-2">5.</span> Workspace</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org1284f71" class="outline-3">
<h3 id="org1284f71"><span class="section-number-3">5.1.</span> Daily routine <code>[0%]</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Learn">Learn</span></span></h3>
<div class="outline-text-3" id="text-5-1">
<p>
:LOGBOOK: - State "DONE"       from              <span class="timestamp-wrapper"><span class="timestamp">[2023-10-02 一 18:53]</span></span>
</p>
<ul class="org-ul">
<li>State "DONE"       from              <span class="timestamp-wrapper"><span class="timestamp">[2023-10-02 一 18:53]</span></span></li>
</ul>
<p>
:END:
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> leetcode</li>
<li class="off"><code>[&#xa0;]</code> exercise</li>
<li class="off"><code>[&#xa0;]</code> coding</li>
</ul>
</div>
</div>
<div id="outline-container-org4727373" class="outline-3">
<h3 id="org4727373"><span class="section-number-3">5.2.</span> <span class="todo TODO">TODO</span> Learn Emacs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Emacs">Emacs</span></span></h3>
<div class="outline-text-3" id="text-5-2">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2023-10-07 六 18:49]</span></span>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孟强定</p>
<p class="date">Created: 2023-10-11 三 14:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>